TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2228/driverlib/empty_driverlib_src/ti/driverlib/dl_timer.h
/**
 *  @brief Disables the capture compare input filter
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 */
void DL_Timer_disableCaptureCompareInputFilter(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief Checks if the capture compare input filter is enabled
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 *  @return Returns the status of capture compare input filter
 *
 *  @retval     true  capture compare input filter is enabled
 *  @retval     false capture compare input filter is disabled
 */
bool DL_Timer_isCaptureCompareInputFilterEnabled(
    GPTIMER_Regs *gptimer, DL_TIMER_CC_INDEX ccIndex);

/**
 *  @brief     Sets dead band fall and raise delay
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  falldelay      The number of TIMCLK periods inserted between
 *                             the fall of CCPi and the rise of CCPBo. Valid
 *                             range [0- 4095]
 *  @param[in]  risedelay      The number of TIMCLK periods inserted
 *                             between the fall of CCPi and the rise of CCPAo.
 *                             Valid range [0- 4095].
 *  @param[in]  mode           Specifies the dead band insertion mode. One of
 *                             @ref DL_TIMER_DEAD_BAND_MODE
 *
 */
__STATIC_INLINE void DL_Timer_setDeadBand(GPTIMER_Regs *gptimer,
    uint16_t falldelay, uint16_t risedelay, uint32_t mode)
{
    gptimer->COUNTERREGS.DBCTL =
        (((uint32_t) falldelay << GPTIMER_DBCTL_FALLDELAY_OFS) |
            (uint32_t) risedelay | mode);
}

/**
 *  @brief    Gets dead band fall delay
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return Dead Band Fall delay in TIMCLK
 */
__STATIC_INLINE uint16_t DL_Timer_getDeadBandFallDelay(GPTIMER_Regs *gptimer)
{
    uint32_t temp =
        (gptimer->COUNTERREGS.DBCTL & GPTIMER_DBCTL_FALLDELAY_MASK) >>
        GPTIMER_DBCTL_FALLDELAY_OFS;

    return ((uint16_t) temp);
}

/**
 *  @brief    Gets dead band rise delay
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return Dead Band Rise delay in TIMCLK
 */
__STATIC_INLINE uint16_t DL_Timer_getDeadBandRiseDelay(GPTIMER_Regs *gptimer)
{
    return (uint16_t)(
        (gptimer->COUNTERREGS.DBCTL) & (GPTIMER_DBCTL_RISEDELAY_MASK));
}

/**
 *  @brief     Set External Trigger Event
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  trigSel        External Trigger Select
 *                             @ref DL_TIMER_EXT_TRIG_SEL
 *
 */
__STATIC_INLINE void DL_Timer_setExternalTriggerEvent(
    GPTIMER_Regs *gptimer, DL_TIMER_EXT_TRIG_SEL trigSel)
{
    DL_Common_updateReg(&gptimer->COUNTERREGS.TSEL, (uint32_t) trigSel,
        GPTIMER_TSEL_ETSEL_MASK);
}

/**
 *  @brief    Gets External Trigger Event
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return @ref DL_TIMER_EXT_TRIG_SEL
 *
 */
__STATIC_INLINE DL_TIMER_EXT_TRIG_SEL DL_Timer_getExternalTriggerEvent(
    GPTIMER_Regs *gptimer)
{
    uint32_t trigSel = gptimer->COUNTERREGS.TSEL & GPTIMER_TSEL_ETSEL_MASK;

    return (DL_TIMER_EXT_TRIG_SEL)(trigSel);
}

/**
 *  @brief     Enables external trigger
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 */
__STATIC_INLINE void DL_Timer_enableExternalTrigger(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.TSEL |= (GPTIMER_TSEL_TE_ENABLED);
}

/**
 *  @brief     Disables external trigger
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 */
__STATIC_INLINE void DL_Timer_disableExternalTrigger(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.TSEL &= ~(GPTIMER_TSEL_TE_ENABLED);
}

/**
 *  @brief     Checks if  external trigger is enabled
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return Returns the status of external trigger
 *
 *  @retval     true  external trigger is enabled
 *  @retval     false external trigger is disabled
 */
__STATIC_INLINE bool DL_Timer_isExternalTriggerEnabled(GPTIMER_Regs *gptimer)
{
    return ((gptimer->COUNTERREGS.TSEL & GPTIMER_TSEL_TE_MASK) ==
            GPTIMER_TSEL_TE_ENABLED);
}

/**
 *  @brief     Sets repeat counter value. Repeat counter feature is used to
 *             reduce interupt overhead.
 *  @note      <b>This feature is not supported by all TimerA instances.</b>
 *             Please refer to the "TIMx Configurations" table in the
 *             device specific datasheet to determine TimerA instances which
 *             support "Repeat Counter" configuration.
 *
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  repeatCount     Specifies repeat counter value
 *
 */
__STATIC_INLINE void DL_Timer_setRepeatCounter(
    GPTIMER_Regs *gptimer, uint8_t repeatCount)
{
    gptimer->COUNTERREGS.RCLD = (repeatCount);
}

/**
 *  @brief     Gets repeat counter value.
 *  @note      <b>This feature is not supported by all TimerA instances.</b>
 *             Please refer to the "TIMx Configurations" table in the
 *             device specific datasheet to determine TimerA instances which
 *             support "Repeat Counter" configuration.
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *
 *  @return Repeat counter value.
 *
 */
__STATIC_INLINE uint8_t DL_Timer_getRepeatCounter(GPTIMER_Regs *gptimer)
{
    return ((uint8_t)(gptimer->COUNTERREGS.RC & GPTIMER_RC_RC_MASK));
}

/**
 *  @brief     Enables phase load
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *
 */
__STATIC_INLINE void DL_Timer_enablePhaseLoad(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.CTRCTL |= (GPTIMER_CTRCTL_PLEN_ENABLED);
}

/**
 *  @brief     Disables phase load
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *
 *
 */
__STATIC_INLINE void DL_Timer_disablePhaseLoad(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.CTRCTL &= ~(GPTIMER_CTRCTL_PLEN_ENABLED);
}

/**
 *  @brief     Checks if phase load enabled
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @return Returns the status of phase load
 *
 *  @retval     true  phase load is enabled
 *  @retval     false phase load is disabled
 *
 */
__STATIC_INLINE bool DL_Timer_isPhaseLoadEnabled(GPTIMER_Regs *gptimer)
{
    return (GPTIMER_CTRCTL_PLEN_ENABLED ==
            (gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_PLEN_MASK));
}

/**
 *  @brief     Sets phase load value
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  value           Phase load value
 *
 */
__STATIC_INLINE void DL_Timer_setPhaseLoadValue(
    GPTIMER_Regs *gptimer, uint16_t value)
{
    gptimer->COUNTERREGS.PL = (value);
}

/**
 *  @brief     Gets phase load value
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *
 *  @return Phase load value
 */
__STATIC_INLINE uint16_t DL_Timer_getPhaseLoadValue(GPTIMER_Regs *gptimer)
{
    return ((uint16_t)(gptimer->COUNTERREGS.PL & GPTIMER_PL_PHASE_MASK));
}

/**
 *  @brief      Starts Timer Counter
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 */
__STATIC_INLINE void DL_Timer_startCounter(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.CTRCTL |= (GPTIMER_CTRCTL_EN_ENABLED);
}

/**
 *  @brief      Stops Timer Counter
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 */
__STATIC_INLINE void DL_Timer_stopCounter(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.CTRCTL &= ~(GPTIMER_CTRCTL_EN_ENABLED);
}

/**
 *  @brief      Check if timer is actively running
 *
 *  @param[in]  gptimer      Pointer to the register overlay for the
 *                            peripheral
 *
 *  @return     Returns the running status of the Timer
 *
 *  @retval     true  Timer is running
 *  @retval     false Timer is not running
 */
__STATIC_INLINE bool DL_Timer_isRunning(GPTIMER_Regs *gptimer)
{
    return ((gptimer->COUNTERREGS.CTRCTL & GPTIMER_CTRCTL_EN_MASK) ==
            GPTIMER_CTRCTL_EN_ENABLED);
}

/**
 *  @brief      Configure Quadrature Encoder Interface (QEI)
 *
 *  @post User should call @ref DL_Timer_setLoadValue and
 *  @ref DL_Timer_startCounter to complete the QEI Configuration.
 *  Refer to Timer TRM for more details.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  mode           Choose QEI input mode. One of @ref DL_TIMER_QEI_MODE
 *  @param[in]  invert         Control whether selected input is inverted.
 *                             One of @ref DL_TIMER_CC_INPUT_INV
 *  @param[in]  ccIndex        Index associated to capture compare register
 *                             @ref DL_TIMER_CC_INDEX.
 */
__STATIC_INLINE void DL_Timer_configQEI(GPTIMER_Regs *gptimer,
    DL_TIMER_QEI_MODE mode, uint32_t invert, DL_TIMER_CC_INDEX ccIndex)
{
    gptimer->COUNTERREGS.CCCTL_01[ccIndex] =
        GPTIMER_CCCTL_01_CCOND_CC_TRIG_RISE | GPTIMER_CCCTL_01_COC_CAPTURE;
    gptimer->COUNTERREGS.IFCTL_01[ccIndex] =
        GPTIMER_IFCTL_01_ISEL_CCPX_INPUT | invert;
    gptimer->COUNTERREGS.CTRCTL =
        (uint32_t) mode | GPTIMER_CTRCTL_CVAE_NOCHANGE |
        GPTIMER_CTRCTL_CM_UP_DOWN | GPTIMER_CTRCTL_REPEAT_REPEAT_1;
}

/**
 *  @brief      Configure Hall Input Mode
 *
 *  @note Refer to device datasheet to determine if timer instance supports
 *  this feature. Only TIMGx instances with QEI support should use this API.
 *
 *  @post User should call @ref DL_Timer_setLoadValue and
 *  @ref DL_Timer_startCounter to complete the Hall Input Mode Configuration.
 *  Refer to Timer TRM for more details.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 */
void DL_Timer_configQEIHallInputMode(GPTIMER_Regs *gptimer);

/**
 *  @brief      Get direction of Quadrature Encoder Interface (QEI) count
 *
 *  @param[in]  gptimer  Pointer to the register overlay for the
 *                       peripheral
 *  @retval     One of @ref DL_TIMER_QEI_DIRECTION values
 */
__STATIC_INLINE DL_TIMER_QEI_DIRECTION DL_Timer_getQEIDirection(
    GPTIMER_Regs *gptimer)
{
    uint32_t qeiDirection = gptimer->COUNTERREGS.QDIR & GPTIMER_QDIR_DIR_MASK;

    return (DL_TIMER_QEI_DIRECTION)(qeiDirection);
}

/**
  *  @brief     Sets Fault Configuration
  *
  *  @param[in]  gptimer        Pointer to the register overlay for the
  *                             peripheral
  *  @param[in]  faultConfMask  Specifies faults configuration. Bitwise OR of
  *                             @ref DL_TIMER_FAULT_CONFIG_TFIM,
  *                             @ref DL_TIMER_FAULT_CONFIG_FL,
  *                             @ref DL_TIMER_FAULT_CONFIG_FI,
  *                             @ref DL_TIMER_FAULT_CONFIG_FIEN
  *
  */
__STATIC_INLINE void DL_Timer_setFaultConfig(
    GPTIMER_Regs *gptimer, uint32_t faultConfMask)
{
    DL_Common_updateReg(&gptimer->COUNTERREGS.FCTL, faultConfMask,
        (GPTIMER_FCTL_TFIM_MASK | GPTIMER_FCTL_FL_MASK | GPTIMER_FCTL_FI_MASK |
            GPTIMER_FCTL_FIEN_MASK));
}

/**
  *  @brief     Gets Fault Configuration
  *
  *  @param[in]  gptimer        Pointer to the register overlay for the
  *                             peripheral
  *
  *  @return Bitwise OR value of @ref DL_TIMER_FAULT_CONFIG_TFIM,
  *          @ref DL_TIMER_FAULT_CONFIG_FL, @ref DL_TIMER_FAULT_CONFIG_FI,
  *          @ref DL_TIMER_FAULT_CONFIG_FIEN
  *
  */
__STATIC_INLINE uint32_t DL_Timer_getFaultConfig(GPTIMER_Regs *gptimer)
{
    return (gptimer->COUNTERREGS.FCTL &
            (GPTIMER_FCTL_FIEN_MASK | GPTIMER_FCTL_FI_MASK |
                GPTIMER_FCTL_FL_MASK | GPTIMER_FCTL_TFIM_MASK));
}

/**
  *  @brief Enables fault input detection
  *
  *  @param[in] gptimer   Pointer to the register overlay for the
  *                       peripheral
  */
__STATIC_INLINE void DL_Timer_enableFaultInput(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.FCTL |= (GPTIMER_FCTL_FIEN_ENABLED);
}

/**
  *  @brief Disables fault input detection
  *
  *  @param[in] gptimer   Pointer to the register overlay for the
  *                       peripheral
  */
__STATIC_INLINE void DL_Timer_disableFaultInput(GPTIMER_Regs *gptimer)
{
    gptimer->COUNTERREGS.FCTL &= ~(GPTIMER_FCTL_FIEN_ENABLED);
}

/**
  *  @brief Specifies if fault input is enabled
  *
  *  @param[in] gptimer   Pointer to the register overlay for the
  *                       peripheral
  *  @return  true  Fault input is enabled
  *  @return  false Fault input is disabled
  */
__STATIC_INLINE bool DL_Timer_isFaultInputEnabled(GPTIMER_Regs *gptimer)
{
    return (GPTIMER_FCTL_FIEN_ENABLED ==
            (gptimer->COUNTERREGS.FCTL & GPTIMER_FCTL_FIEN_MASK));
}

/**
 *  @brief Enables source clock fault detection
 *
 *  @param[in] gptimer Pointer to the register overlay for the
 *                     peripheral
 */
__STATIC_INLINE void DL_Timer_enableClockFaultDetection(GPTIMER_Regs *gptimer)
{
    gptimer->COMMONREGS.FSCTL |= (GPTIMER_FSCTL_FCEN_DISABLE);
}

/**
 *  @brief Disables source clock fault detection
 *
 *  @param[in] gptimer Pointer to the register overlay for the
 *                     peripheral
 */
__STATIC_INLINE void DL_Timer_disableClockFaultDetection(GPTIMER_Regs *gptimer)
{
    gptimer->COMMONREGS.FSCTL &= ~(GPTIMER_FSCTL_FCEN_DISABLE);
}

/**
 *  @brief Specifies if source clock fault detection is enabled
 *
 *  @param[in] gptimer Pointer to the register overlay for the
 *                    peripheral
 *  @return true if source clock fault detection is enabled
 *  @return false if source clock fault detection is disabled
 */
__STATIC_INLINE bool DL_Timer_isClockFaultDetectionEnabled(
    GPTIMER_Regs *gptimer)
{
    return (GPTIMER_FSCTL_FCEN_ENABLE ==
            (gptimer->COMMONREGS.FSCTL & GPTIMER_FSCTL_FCEN_MASK));
}

/**
  *  @brief Configures the fault source and and fault input mode
  *
  *  @param[in] gptimer Pointer to the register overlay for the
  *                     peripheral
  *  @param[in] source  Selects fault source and and fault input mode. One of
  *                     @ref DL_TIMER_FAULT_SOURCE.
  *
  */
void DL_Timer_setFaultSourceConfig(GPTIMER_Regs *gptimer, uint32_t source);

/**
  *  @brief
  *
  *  @param[in] gptimer Pointer to the register overlay for the
  *                     peripheral
  *  @return The fault source and and fault input mode. One of
  *          @ref DL_TIMER_FAULT_SOURCE.
  */
uint32_t DL_Timer_getFaultSourceConfig(GPTIMER_Regs *gptimer);

/**
  *  @brief     Set Fault Input Filtering Configuration
  *
  *  @param[in]  gptimer        Pointer to the register overlay for the
  *                             peripheral
  *  @param[in]  filten         Specifies input is filter mode
  *                             @ref DL_TIMER_FAULT_FILT
  *  @param[in]  cpv            Specifies input filter type
  *                             @ref DL_TIMER_FAULT_FILTER_CPV
  *  @param[in]  fp             Specifies sample period for the input filter
  *                             @ref DL_TIMER_FAULT_FILTER_FP
  *
  */
__STATIC_INLINE void DL_Timer_setFaultInputFilterConfig(
    GPTIMER_Regs *gptimer, uint32_t filten, uint32_t cpv, uint32_t fp)
{
    gptimer->COUNTERREGS.FIFCTL = (filten | cpv | fp);
}

/**
  *  @brief     Get Fault Input Filtering Configuration
  *
  *  @param[in]  gptimer        Pointer to the register overlay for the
  *                             peripheral
  *  @return Bitwise OR of @ref DL_TIMER_FAULT_FILT,
  *          @ref DL_TIMER_FAULT_FILTER_CPV and  @ref DL_TIMER_FAULT_FILTER_FP
  *
  */
__STATIC_INLINE uint32_t DL_Timer_getFaultInputFilterConfig(
    GPTIMER_Regs *gptimer)
{
    return (gptimer->COUNTERREGS.FIFCTL);
}

/**
 *  @brief     Configures output behavior upon fault entry and exit
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  faultEntry      Specifies the fault entry behavior.
 *                              One of @ref DL_TIMER_FAULT_ENTRY_CCP
 *  @param[in]  faultExit       Specifies the fault exit behavior.
 *                              One of @ref DL_TIMER_FAULT_EXIT_CCP
 *  @param[in]  ccIndex         Index associated to capture compare register
 *                              @ref DL_TIMER_CC_INDEX.
 *
 */
__STATIC_INLINE void DL_Timer_configFaultOutputAction(GPTIMER_Regs *gptimer,
    DL_TIMER_FAULT_ENTRY_CCP faultEntry, DL_TIMER_FAULT_EXIT_CCP faultExit,
    DL_TIMER_CC_INDEX ccIndex)
{
    DL_Common_updateReg(&gptimer->COUNTERREGS.CCACT_01[ccIndex],
        ((uint32_t) faultEntry | (uint32_t) faultExit),
        (GPTIMER_CCACT_01_FEXACT_MASK | GPTIMER_CCACT_01_FENACT_MASK));
}

/**
 *  @brief     Configures timer counter behavior upon fault entry and exit
 *
 *  @param[in]  gptimer         Pointer to the register overlay for the
 *                              peripheral
 *  @param[in]  faultEntry      Specifies the fault entry behavior.
 *                              One of @ref DL_TIMER_FAULT_ENTRY_CTR
 *  @param[in]  faultExit       Specifies the fault exit behavior.
 *                              One of @ref DL_TIMER_FAULT_EXIT_CTR
 *
 */
__STATIC_INLINE void DL_Timer_configFaultCounter(GPTIMER_Regs *gptimer,
    DL_TIMER_FAULT_ENTRY_CTR faultEntry, DL_TIMER_FAULT_EXIT_CTR faultExit)
{
    DL_Common_updateReg(&gptimer->COUNTERREGS.CTRCTL,
        ((uint32_t) faultEntry | (uint32_t) faultExit),
        (GPTIMER_CTRCTL_FRB_MASK | GPTIMER_CTRCTL_FB_MASK));
}

/**
 *  @brief      Enable timer interrupts
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMER_INTERRUPT.
 */
__STATIC_INLINE void DL_Timer_enableInterrupt(
    GPTIMER_Regs *gptimer, uint32_t interruptMask)
{
    gptimer->CPU_INT.IMASK |= interruptMask;
}

/**
 *  @brief      Disable timer interrupts
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to enable. Bitwise OR of
 *                             @ref DL_TIMER_INTERRUPT.
 */
__STATIC_INLINE void DL_Timer_disableInterrupt(
    GPTIMER_Regs *gptimer, uint32_t interruptMask)
{
    gptimer->CPU_INT.IMASK &= ~(interruptMask);
}

/**
 *  @brief      Check which timer interrupts are enabled
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_TIMER_INTERRUPT.
 *
 *  @return     Which of the requested timer interrupts are enabled
 *
 *  @retval     Bitwise OR of @ref DL_TIMER_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_Timer_getEnabledInterrupts(
    GPTIMER_Regs *gptimer, uint32_t interruptMask)
{
    return (gptimer->CPU_INT.IMASK & interruptMask);
}

/**
 *  @brief      Check interrupt flag of enabled timer interrupts
 *
 *  Checks if any of the timer interrupts that were previously enabled are
 *  pending.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_TIMER_INTERRUPT.
 *
 *  @return     Which of the requested timer interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_TIMER_INTERRUPT values
 *
 *  @sa         DL_Timer_enableInterrupt
 */
__STATIC_INLINE uint32_t DL_Timer_getEnabledInterruptStatus(
    GPTIMER_Regs *gptimer, uint32_t interruptMask)
{
    return (gptimer->CPU_INT.MIS & interruptMask);
}

/**
 *  @brief      Check interrupt flag of any timer interrupt
 *
 *  Checks if any of the timer interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to check. Bitwise OR of
 *                             @ref DL_TIMER_INTERRUPT.
 *
 *  @return     Which of the requested timer interrupts are pending
 *
 *  @retval     Bitwise OR of @ref DL_TIMER_INTERRUPT values
 */
__STATIC_INLINE uint32_t DL_Timer_getRawInterruptStatus(
    GPTIMER_Regs *gptimer, uint32_t interruptMask)
{
    return (gptimer->CPU_INT.RIS & interruptMask);
}

/**
 *  @brief      Get highest priority pending timer interrupt
 *
 *  Checks if any of the timer interrupts are pending. Interrupts do not have to
 *  be previously enabled.
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *
 *  @return     The highest priority pending timer interrupt. One of
 *              @ref DL_TIMER_IIDX
 */
__STATIC_INLINE DL_TIMER_IIDX DL_Timer_getPendingInterrupt(
    GPTIMER_Regs *gptimer)
{
    return ((DL_TIMER_IIDX) gptimer->CPU_INT.IIDX);
}

/**
 *  @brief      Clear pending timer interrupts
 *
 *  @param[in]  gptimer        Pointer to the register overlay for the
 *                             peripheral
 *  @param[in]  interruptMask  Bit mask of interrupts to clear. Bitwise OR of
 *                             @ref DL_TIMER_INTERRUPT.
 */
__STATIC_INLINE void DL_Timer_clearInterruptStatus(
    GPTIMER_Regs *gptimer, uint32_t interruptMask)
{
    gptimer->CPU_INT.ICLR = interruptMask;
}

/**
 *  @brief Sets the event publisher channel id
 *
 *  @param[in]  gptimer Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  index   Specifies the register event index to be configured
 *  @param[in]  chanID  Channel ID number. Valid range 0-15. If ChanID == 0
 *                      publisher is disconnected.
 */
__STATIC_INLINE void DL_Timer_setPublisherChanID(
    GPTIMER_Regs *gptimer, DL_TIMER_PUBLISHER_INDEX index, uint8_t chanID)
{
    volatile uint32_t *pReg = &gptimer->FPUB_0;

    *(pReg + (uint32_t) index) = (chanID & GPTIMER_FPUB_0_CHANID_MAXIMUM);
}

/**
 *  @brief Gets the event publisher channel id
 *
 *  @param[in]  gptimer Pointer to the register overlay for the
 *                      peripheral
 *  @param[in]  index  Specifies the register event index to be configured
 *
 *  @return     Event publisher channel ID
 *
 */
__STATIC_INLINE uint8_t DL_Timer_getPublisherChanID(
    GPTIMER_Regs *gptimer, DL_TIMER_PUBLISHER_INDEX index)
{
    volatile uint32_t *pReg = &gptimer->FPUB_0;

    return (
        (uint8_t)(*(pReg + (uint32_t) index) & GPTIMER_FPUB_0_CHANID_MASK));
}

